# Задача 1. Выражения
print(6 * 39)
print(3 ** 5)
print(-8 / -4)
print((10 / 2) + 6)

# Задача 2. Эти замечательные астрологи
a, b, c = 5, 4, 2
print('Сложение: ', a + b + c)
print('Вычитание:', a - b - c)
print('Умножение:', a * b * c)
print('Деление:', a / b / c)
print('Возведение в степень:', a ** b ** c)

# Задача 3. Деление на ноль
print(3 / 0)