# Задача 1. Сбой
a = 6
b = 2
c = 0
if b < a:
    c = a * b
print(c)

# Задача 2. Курс от Skillbox
sum = int(input('Введите состояние счёта: '))
if sum >= 75000:
    sum -= 75000
    print('Курс успешно приобретён!')
print('Хорошего дня!')

# Задача 3. Дружба
number = int(input("Введите число: "))
if number % 2 == 0:
    print("Число чётное")